/* eslint-disable */
// 统一规范，游戏名称
export const gameId = [
  {
    title: '时时彩',
    title_en: 'ssc',
    children: [
      {'game_id':2, 'name': '重庆时时彩', 'name_en': 'cqssc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':5, 'name': '腾讯分分彩', 'name_en': 'txffc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':6, 'name': '三分时时彩', 'name_en': 'sfssc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '新疆时时彩', 'name_en': 'xjssc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '天津时时彩', 'name_en': 'tqssc', time: '', 'game_link':'', 'bet_type':{}}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "时时彩投注区分为万位、千位、百位、十位和个位，各位号码范围为0～9。每期从各位上开出1个号码作为中奖号码，即开奖号码为5位数。时时彩玩法即是竞猜5位开奖号码的全部号码、部分号码或部分号码特征。"
      }, {
          "content": "时时彩中“复式”和“单式”的玩法规则相同，区别于单式需手动勾选位置、输入号码。"
      }, {
          "content": "时时彩分星彩玩法和大小单双玩法。星彩玩法包括五星、三星、二星和一星。",
          "children": [{
              "title": "直选",
              "content": "将投注号码以唯一的排列方式进行投注。"
          }, {
              "title": "组选",
              "content": "将投注号码的所有排列方式作为一注投注号码进行投注。示例：123，排列方式有123、132、213、231、312、321，共计6种。"
          }, {
              "title": "组选三",
              "content": "在三星组选中，如果一注组选号码的3个数字有两个数字相同，则有3种不同的排列方式，因而就有3个中奖机会，这种组选投注方式简称组选三。示例：112，排列方式有112、121、211。"
          }, {
              "title": "组选六",
              "content": "在三星组选中，如果一注组选号码的3个数字各不相同，则有6种不同的排列方式，因而就有6个中奖机会，这种组选投注方式简称组选六。示例：123，排列方式有123、132、213、231、312、321，共计6种。"
          }, {
              "title": "大小单双",
              "content": "号码0～9中，0～4为小，5～9为大，1、3、5、7、9为单，0、2、4、6、8为双。"
          }, {
              "title": "龙虎",
              "content": "根据指定位置上的号码数值比大小，首选号大于后选号为龙，小则为虎。"
          }, {
              "title": "跨度",
              "content": "对指定位置上的号码的最大最小数字差值进行投注。"
          }]
      }],
      "timing": [{
          "title": "重庆时时彩",
          "content": "10:00-22:00（73期），每10分钟一期，22:00-02:00（47期），每5分钟一期，全天120期"
      }, {
          "title": "天津时时彩",
          "content": "09:10-22:55，每10分钟一期，全天84期"
      }, {
          "title": "分分时时彩",
          "content": "00:00-00:00（次日），每1分钟一期，全天1440期"
      }, {
          "title": "三分时时彩",
          "content": "00:00-00:00（次日），每3分钟一期，全天480期"
      }, {
          "title": "新疆时时彩",
          "content": "10:10-02:00，每10分钟一期，全天96期"
      }, {
          "title": "北京时时彩",
          "content": "09:05-23:55，每5分钟一期，全天179期"
      }, {
          "title": "腾讯分分彩",
          "content": "00:00-00:00（次日），每1分钟一期，全天1440期"
      }]
  },
  "rule": [{
      "title": "五星",
      "children": [{
          "title": "五星直选",
          "children": [{
              "title": "复式",
              "content": "从万千百十个位各选1个号码，所选号与开奖号相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个五位数号码，所选号与开奖号相同，且顺序一致，即为中奖。"
          }, {
              "title": "组合",
              "content": "从万、千、百、十、个位中各选1个号码组成1-5星组合，共5注。所选号的个位与开奖号个位相同，则中1个5等奖；所选号的十、个位与开奖号十、个位相同，则中1个5等奖和4等奖，以此类推，最高可中5个奖。如所选号个位不中奖，则余号均视为不中奖。"
          }]
      }, {
          "title": "五星组选",
          "children": [{
              "title": "组选120",
              "content": "从0-9中任选5个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。"
          }, {
              "title": "组选60",
              "content": "选1个二重号，3个单号组成一注。不限顺序，开奖号中包含全部所选号，且二重号出现2次，即为中奖。"
          }, {
              "title": "组选30",
              "content": "选2个二重号，1个单号组成一注。不限顺序，开奖号中包含全部所选号，且2个二重号各出现2次，即为中奖。"
          }, {
              "title": "组选20",
              "content": "选1个三重号，2个单号组成一注。不限顺序，开奖号中包含全部所选号，且三重号出现3次，即为中奖。"
          }, {
              "title": "组选10",
              "content": "从三重号和二重号中各选1个号码组成一注。不限顺序，开奖号中所选的三重号出现3次，二重号出现2次，即为中奖。"
          }, {
              "title": "组选5",
              "content": "选1个四重号，1个单号组成一注。不限顺序，开奖号中包含全部所选号，且四重号出现4次，即为中奖。"
          }]
      }]
  }, {
      "title": "四星",
      "children": [{
          "title": "后四直选",
          "children": [{
              "title": "复式",
              "content": "从千、百、十、个位中各选1个号码，所选号与开奖号后四位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个四位数号码，所选号与开奖号后四位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "组合",
              "content": "从千、百、十、个位中各选1个号码组成1-4星组合，共4注。所选号的个位与开奖号个位相同，则中1个4等奖；所选号的十、个位与开奖号十、个位相同，则中1个4等奖和3等奖，以此类推，最高可中4个奖。如所选号个位不中奖，则余号均视为不中奖。"
          }]
      }, {
          "title": "后四组选",
          "children": [{
              "title": "组选24",
              "content": "从0-9中任选4个号码组成一注。不限顺序，开奖号后四位中包含全部所选号，即为中奖。"
          }, {
              "title": "组选12",
              "content": "选1个二重号，2个单号组成一注。不限顺序，开奖号后四位中包含全部所选号，且二重号出现2次，即为中奖。"
          }, {
              "title": "组选6",
              "content": "选2个二重号组成一注。不限顺序，开奖号后四位中2个二重号各出现2次，即为中奖。"
          }, {
              "title": "组选4",
              "content": "选1个三重号，1个单号组成一注。不限顺序，开奖号后四位中包含全部所选号，且三重号出现3次，即为中奖。"
          }]
      }, {
          "title": "前四直选",
          "children": [{
              "title": "复式",
              "content": "从万、千、百、十位中各选1个号码，所选号与开奖号前四位相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个四位数号码，所选号与开奖号前四位相同，且顺序一致，即为中奖。"
          }, {
              "title": "组合",
              "content": "从万、千、百、十位中各选1个号码组成1-4星组合，共4注。所选号的十位与开奖号十位相同，则中1个4等奖； 所选号的百、十位与开奖号百、十位相同，则中1个4等奖和3等奖，以此类推，最高可中4个奖。"
          }]
      }, {
          "title": "前四组选",
          "children": [{
              "title": "组选24",
              "content": "从0-9中任选4个号码组成一注。不限顺序，开奖号前四位中包含全部所选号，即为中奖。"
          }, {
              "title": "组选12",
              "content": "选1个二重号，2个单号组成一注。不限顺序，开奖号前四位中包含全部所选号，且二重号出现2次，即为中奖。"
          }, {
              "title": "组选6",
              "content": "选2个二重号组成一注。不限顺序，开奖号前四位中2个二重号各出现2次，即为中奖。"
          }, {
              "title": "组选4",
              "content": "选1个三重号，1个单号组成一注。不限顺序，开奖号前四位中包含全部所选号，且三重号出现3次，即为中奖。"
          }]
      }]
  }, {
      "title": "三星",
      "children": [{
          "title": "后三直选",
          "children": [{
              "title": "复式",
              "content": "从百、十、个位中各选1个号码，所选号与开奖号后三位相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个三位数号码，所选号与开奖号后三位相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选和值",
              "content": "从0-27中任选一个号，所选号数值等于开奖号后三位数相加之和，即为中奖。"
          }, {
              "title": "直选跨度",
              "content": "从0-9中任选1个号码组成一注。所选号数值等于开奖号后三位的最大最小数字差值，即为中奖。"
          }, {
              "title": "和值尾数",
              "content": "对开奖号后三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。开奖号后三位号码相加之和的尾数与所选号相同，即为中奖。"
          }]
      }, {
          "title": "后三组选",
          "children": [{
              "title": "组三",
              "content": "从0-9中任选2个号码组成两注。不限顺序，开奖号后三位中包含全部所选号，且其中一个所选号出现2次，即为中奖。"
          }, {
              "title": "组六",
              "content": "任选3个不同的号码组成一注。开奖号后三位中包含全部所选号，即为中奖。"
          }, {
              "title": "混合组选",
              "content": "手动输入一个3位数号码（不含豹子号）组成一注。其中1个所选号在开奖号后三位中出现2次， 则中组三奖；开奖号后三位中包含全部所选号，且无重复号码出现，则中组六奖。"
          }, {
              "title": "组选包胆",
              "content": "从0-9中任选1个包胆号码为一注。不限顺序，开奖号后三位中包含所选的包胆号（不含豹子号），即为中奖。"
          }]
      }, {
          "title": "中三直选",
          "children": [{
              "title": "复式",
              "content": "从千、百、十位中各选1个号码，所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个三位数号码，所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选和值",
              "content": "从0-27中任选一个号，所选号数值等于开奖号中间三位数相加之和，即为中奖。"
          }, {
              "title": "直选跨度",
              "content": "从0-9中任选1个号码组成一注。所选号数值等于开奖号中间三位的最大最小数字差值，即为中奖。"
          }, {
              "title": "和值尾数",
              "content": "对开奖号中间三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。开奖号中间三位号码相加之和的尾数与所选号相同，即为中奖。"
          }]
      }, {
          "title": "中三组选",
          "children": [{
              "title": "组三",
              "content": "从0-9中任选2个号码组成两注。不限顺序，开奖号中间三位中包含全部所选号，且其中一个所选号出现2次，即为中奖。"
          }, {
              "title": "组六",
              "content": "任选3个不同的号码组成一注。开奖号中间三位中包含全部所选号，即为中奖。"
          }, {
              "title": "混合组选",
              "content": "手动输入一个3位数号码（不含豹子号），其中1个所选号在开奖号中间三位里出现2次，则中组三奖； 开奖号中间三位中包含全部所选号，且无重复号码出现，则中组六奖。"
          }, {
              "title": "组选包胆",
              "content": "从0-9中任选1个包胆号码为一注。不限顺序，开奖号中间三位中包含所选的包胆号（不含豹子号），即为中奖。"
          }]
      }, {
          "title": "前三直选",
          "children": [{
              "title": "复式",
              "content": "从万、千、百位中各选1个号码，所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个三位数号码，所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选和值",
              "content": "从0-27中任选一个号，所选号数值等于开奖号前三位数相加之和，即为中奖。"
          }, {
              "title": "直选跨度",
              "content": "从0-9中任选1个号码组成一注。所选号数值等于开奖号前三位的最大最小数字差值，即为中奖。"
          }, {
              "title": "和值尾数",
              "content": "对开奖号前三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。开奖号前三位号码相加之和的尾数与所选号相同，即为中奖。"
          }]
      }, {
          "title": "前三组选",
          "children": [{
              "title": "组三",
              "content": "从0-9中任选2个号码组成两注。不限顺序，开奖号前三位中包含全部所选号，且其中一个所选号出现2次，即为中奖。"
          }, {
              "title": "组六",
              "content": "任选3个不同的号码组成一注。开奖号前三位中包含全部所选号，即为中奖。"
          }, {
              "title": "混合组选",
              "content": "手动输入一个3位数号码（不含豹子号），其中1个所选号在开奖号前三位中出现2次， 则中组三奖；开奖号前三位中包含全部所选号，且无重复号码出现，则中组六奖。"
          }, {
              "title": "组选包胆",
              "content": "从0-9中任选1个包胆号码为一注。不限顺序，开奖号前三位中包含所选的包胆号（不含豹子号），即为中奖。"
          }]
      }]
  }, {
      "title": "二星",
      "children": [{
          "title": "后二直选",
          "children": [{
              "title": "复式",
              "content": "从十、个位中各选1个号码，所选号与开奖号后二位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位数号码，所选号与开奖号后二位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选和值",
              "content": "从0-18中任选一个号，所选号数值等于开奖号后两位数相加之和，即为中奖。"
          }, {
              "title": "直选跨度",
              "content": "从0-9中任选1个号码组成一注。所选号数值等于开奖号后两位的最大最小数字差值，即为中奖。"
          }, {
              "title": "和值尾数",
              "content": "对开奖号后两位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。开奖号后两位号码相加之和的尾数与所选号相同，即为中奖。"
          }]
      }, {
          "title": "后二组选",
          "children": [{
              "title": "复式",
              "content": "从0-9中任选2个号码，不限顺序，开奖号后两位数中包含所选号，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位数号码，不限顺序，开奖号后两位数中包含所选号即为中奖。"
          }, {
              "title": "组选包胆",
              "content": "从0-9中任选1个包胆号码为一注。不限顺序，开奖号后两位中包含所选的包胆号（不含对子号），即为中奖。"
          }]
      }, {
          "title": "前二直选",
          "children": [{
              "title": "复式",
              "content": "从万、千位中各选1个号码，所选号与开奖号前二位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位数号码，所选号与开奖号前二位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选和值",
              "content": "从0-18中任选1个号码，所选号数值等于开奖号前两位数相加之和，即为中奖。"
          }, {
              "title": "直选跨度",
              "content": "从0-9中任选1个号码组成一注。所选号数值等于开奖号前两位的最大最小数字差值，即为中奖。"
          }, {
              "title": "和值尾数",
              "content": "对开奖号前两位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。开奖号前两位号码相加之和的尾数与所选号相同，即为中奖。"
          }]
      }, {
          "title": "前二组选",
          "children": [{
              "title": "复式",
              "content": "从0-9中任选2个号码，不限顺序，开奖号前两位数中包含所选号，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位数号码，不限顺序，开奖号前两位数中包含所选号，即为中奖。"
          }, {
              "title": "组选包胆",
              "content": "从0-9中任选1个包胆号码为一注。不限顺序，开奖号前两位中包含所选的包胆号（不含对子号），即为中奖。"
          }]
      }]
  }, {
      "title": "不定位",
      "children": [{
          "title": "三星不定位",
          "children": [{
              "title": "后三一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号后三位号码中包含所选号，即为中奖。"
          }, {
              "title": "中三一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号中间三位号码中包含所选号，即为中奖。"
          }, {
              "title": "前三一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号前三位号码中包含所选号，即为中奖。"
          }, {
              "title": "后三二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号后三位号码中包含所选的2个号码，即为中奖。"
          }, {
              "title": "中三二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号中间三位号码中包含所选的2个号码，即为中奖。"
          }, {
              "title": "前三二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号前三位号码中包含所选的2个号码，即为中奖。"
          }]
      }, {
          "title": "四星不定位",
          "children": [{
              "title": "前四一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号前四位中包含所选号，即为中奖。"
          }, {
              "title": "后四一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号后四位中包含所选号，即为中奖。"
          }, {
              "title": "前四二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号前四位中包含所选的二码，即为中奖。"
          }, {
              "title": "后四二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号后四位中包含所选的二码，即为中奖。"
          }, {
              "title": "前四三码",
              "content": "从0-9中任选3个号码为一注。不限顺序，开奖号前四位中包含所选的三码，即为中奖。"
          }, {
              "title": "后四三码",
              "content": "从0-9中任选3个号码为一注。不限顺序，开奖号后四位中包含所选的三码，即为中奖。"
          }]
      }, {
          "title": "五星不定位",
          "children": [{
              "title": "五星一码",
              "content": "从0-9中任选1个号码为一注。不限顺序，开奖号中包含所选号，即为中奖。"
          }, {
              "title": "五星二码",
              "content": "从0-9中任选2个号码为一注。不限顺序，开奖号中包含所选的二码，即为中奖。"
          }, {
              "title": "五星三码",
              "content": "从0-9中任选3个号码为一注。不限顺序，开奖号中包含所选的三码，即为中奖。"
          }, {
              "title": "五星四码",
              "content": "从0-9中任选4个号码为一注。不限顺序，开奖号中包含所选的四码，即为中奖。"
          }]
      }]
  }, {
      "title": "任选",
      "children": [{
          "title": "任二",
          "children": [{
              "title": "复式",
              "content": "从万、千、百、十、个位中的任意两个位置上各选1个号码，所选2个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动勾选任意两个位置，并输入1个两位数号码，所选2个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。"
          }, {
              "title": "组选",
              "content": "从万、千、百、十、个位中的任意两个位置上各选1个号码，不限顺序，所选2个位置上的开奖号中包含全部所选号，即为中奖。"
          }]
      }, {
          "title": "任三",
          "children": [{
              "title": "复式",
              "content": "从万、千、百、十、个位中的任意三个位置上各选1个号码，所选3个位置上的开奖号与所选号相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动勾选任意三个位置，并输入1个三位数号码，所选3个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。"
          }, {
              "title": "组三",
              "content": "手动勾选任意三个位置，并从0-9中任选2个号码为两注。不限顺序，所选3个位置上的开奖号中包含全部所选号，且其中一个号码出现两次，即为中奖。"
          }, {
              "title": "组六",
              "content": "手动勾选任意三个位置，并从0-9中任选3个不同的号码为一注。不限顺序，所选3个位置上的开奖号中包含全部所选号，即为中奖。"
          }, {
              "title": "混合组选",
              "content": "勾选任意三个位置，并手动输入1个三位数号码（不含豹子号）为一注。不限顺序，所选3个位置上的开奖号中包含全部输入号，且其中一个号码出现2次，则中组三奖；不限顺序，所选3个位置上的开奖号与全部输入号相同，则中组六奖。"
          }]
      }, {
          "title": "任四",
          "children": [{
              "title": "复式",
              "content": "从万、千、百、十、个位中任意4个位置上各选1个号码，所选4个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1位四位数号码，并勾选4个位置，所选4个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。"
          }]
      }]
  }, {
      "title": "趣味",
      "children": [{
          "title": "特殊",
          "children": [{
              "title": "一帆风顺",
              "content": "从0-9中任选1个号码，不限顺序，开奖号中包含所选号，即为中奖。"
          }, {
              "title": "好事成双",
              "content": "从0-9中任选1个二重号，所选号在开奖号中出现2次，即为中奖。"
          }, {
              "title": "三星报喜",
              "content": "从0-9中任选1个三重号，所选号在开奖号中出现3次，即为中奖。"
          }, {
              "title": "四季发财",
              "content": "从0-9中任选1个四重号，所选号在开奖号中出现4次，即为中奖。"
          }]
      }, {
          "title": "龙虎",
          "children": [{
              "title": "万千",
              "content": "根据万位和千位的数字比大小，万位号码大于千位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "万百",
              "content": "根据万位和百位的数字比大小，万位号码大于百位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "万十",
              "content": "根据万位和十位的数字比大小，万位号码大于十位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "万个",
              "content": "根据万位和个位的数字比大小，万位号码大于个位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "千百",
              "content": "根据千位和百位的数字比大小，千位号码大于百位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "千十",
              "content": "根据千位和十位的数字比大小，千位号码大于十位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "千个",
              "content": "根据千位和个位的数字比大小，千位号码大于个位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "百十",
              "content": "根据百位和十位的数字比大小，百位号码大于十位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "百个",
              "content": "根据百位和个位的数字比大小，百位号码大于个位号码则为龙，小于则为虎，相同则为和。"
          }, {
              "title": "十个",
              "content": "根据十位和个位的数字比大小，十位号码大于个位号码则为龙，小于则为虎，相同则为和。"
          }]
      }]
  }, {
      "title": "大小单双",
      "children": [{
          "title": "总和",
          "children": [{
              "title": "总和",
              "content": "对5个开奖号相加之和的大（23～45）、小（0~22）、单（总和值为单）、双（总和值为双）进行投注，任选1个形态为一注。所选形态与开奖号5个号码相加之和相同，即为中奖。"
          }]
      }, {
          "title": "定位",
          "children": [{
              "title": "万位",
              "content": "对开奖号的万位进行大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选形态与开奖号的万位号码形态相同，即为中奖。"
          }, {
              "title": "千位",
              "content": "对开奖号的千位进行大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选形态与开奖号的千位号码形态相同，即为中奖。"
          }, {
              "title": "百位",
              "content": "对开奖号的百位进行大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选形态与开奖号的百位号码形态相同，即为中奖。"
          }, {
              "title": "十位",
              "content": "对开奖号的十位进行大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选形态与开奖号的十位号码形态相同，即为中奖。"
          }, {
              "title": "个位",
              "content": "对开奖号的个位进行大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选形态与开奖号的个位号码形态相同，即为中奖。"
          }]
      }, {
          "title": "串关",
          "children": [{
              "title": "串关",
              "content": "对5个开奖号的大（5~9）、小（0~4）、单、双进行投注，任选1个形态为一注。所选位置及形态与开奖号的位置及形态相同，即为中奖。注：如当次所选的位置及形态有多个，则须与开奖号位置及形态全部相同，只中任意一个位置或形态均不算中奖。"
          }]
      }]
  }, {
      "title": "特殊号",
      "children": [{
          "title": "特殊号",
          "children": [{
              "title": "前三",
              "content": "对开奖号前三位的号码形态进行投注，任选1个形态组成一注。不限顺序，开奖号前三位的号码形态与所选形态相同，即为中奖。\r\n                                            中奖顺序：豹子（3个号码相同）>顺子（3个号码相连）>对子（3个号码中任意2个号码相同）>半顺（3个号码中任意2个号码相连）>杂六（不含豹子、顺子、对子、半顺的号码，即3个号码之间无关联性）"
          }, {
              "title": "中三",
              "content": "对开奖号中间三位号码的形态进行投注，任选1个形态组成一注。不限顺序，开奖号中间三位的号码形态与所选形态相同，即为中奖。\r\n                                            中奖顺序：豹子（3个号码相同）>顺子（3个号码相连）>对子（3个号码中任意2个号码相同）>半顺（3个号码中任意2个号码相连）>杂六（不含豹子、顺子、对子、半顺的号码，即3个号码之间无关联性）"
          }, {
              "title": "后三",
              "content": "对开奖号后三位号码的形态进行投注，任选1个形态组成一注。不限顺序，开奖号后三位的号码形态与所选形态相同，即为中奖。\r\n                                            中奖顺序：豹子（3个号码相同）>顺子（3个号码相连）>对子（3个号码中任意2个号码相同）>半顺（3个号码中任意2个号码相连）>杂六（不含豹子、顺子、对子、半顺的号码，即3个号码之间无关联性）"
          }]
      }]
  }, {
      "title": "定位胆",
      "children": [{
          "title": "定位胆",
          "children": [{
              "title": "定位胆",
              "content": "任选1个位置并选1个号码组成一注。所选号与相同位置上的开奖号一致，即为中奖。"
          }]
      }]
  }, {
      "title": "斗牛",
      "children": [{
          "title": "斗牛",
          "children": [{
              "title": "斗牛",
              "content": "开奖号码中任意三位的和值为10的倍数（注：0看做10），为有牛，否则为无牛。若为有牛，剩余两位的和值的尾数是0，为牛牛；剩余两位的和值的尾数是X（X表示1~9），为牛X。从牛牛、无牛、牛一～牛九选择1个组成1注，所选投注组合与开奖号码的型态一致，为中奖。"
          }]
      }]
  }]
  },
  {
    title: 'PC蛋蛋',
    title_en: 'pcdd',
    children: [
      {'game_id':6, 'name': '幸运28', 'name_en': 'xy28', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '北京28', 'name_en': 'bj28', time: '', 'game_link':'', 'bet_type':{}}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "投注号码竞猜范围为0-27，共28个号码。每期开出3个号码作为开奖号码，3个号码之和即为特码。"
      }, {
          "content": "玩法分为：豹子、混合、色波、特码和特码包三。"
      }, {
          "content": "混合：指对开奖特码的形态进行投注，形态号码如下",
          "children": [{
              "title": "大小",
              "content": "14~27为大，0~13为小"
          }, {
              "title": "极大小",
              "content": "22~27为极大，0~5为极小"
          }, {
              "title": "大单",
              "content": "15、17、19、21、23、25、27"
          }, {
              "title": "大双",
              "content": "14、16、18、20、22、24、26"
          }, {
              "title": "小单",
              "content": "1、3、5、7、9、11、13"
          }, {
              "title": "小双",
              "content": "0、2、4、6、8、10、12"
          }]
      }, {
          "content": "色波：指对开奖特码的色波进行投注，色波号码如下：",
          "children": [{
              "title": "绿波号码",
              "content": "1、4、7、10、16、19、22、25"
          }, {
              "title": "蓝波号码",
              "content": "2、5、8、11、17、20、23、26"
          }, {
              "title": "红波号码",
              "content": "3、6、9、12、15、18、21、24"
          }, {
              "title": "灰波号码",
              "content": "0、13、14、27（若开出灰波号码，则投注任何色波均视为不中奖。）"
          }]
      }],
      "timing": [{
          "title": "北京28",
          "content": "9:05-23:55，每5分钟一期，全天179期"
      }, {
          "title": "幸运28",
          "content": "08:00-06:00（次日），每2分钟一期，全天660期（06:00-08:00期间不开奖）"
      }]
  },
  "rule": [{
      "title": "混合",
      "children": [{
          "title": "混合",
          "children": [{
              "title": "混合",
              "content": "对特码的大（14-27）、小（0-13）、单、双、极大（22-27）、极小（0-5）形态进行投注，任选1个形态组成一注。所选形态与开奖特码的形态相同，即为中奖。"
          }]
      }]
  }, {
      "title": "色波",
      "children": [{
          "title": "色波",
          "children": [{
              "title": "色波",
              "content": "对开奖特码的色波进行投注，任选1个色波组成一注。所选色波与开奖特码色波相同，即为中奖。如开出灰波（0、13、14、27）则投注任何色波均视为不中奖。"
          }]
      }]
  }, {
      "title": "豹子",
      "children": [{
          "title": "豹子",
          "children": [{
              "title": "豹子",
              "content": "投注当期的3个开奖号为豹子号码。3个开奖号码为同一号码，即为中奖。"
          }]
      }]
  }, {
      "title": "特码包三",
      "children": [{
          "title": "特码包三",
          "children": [{
              "title": "特码包三",
              "content": "对开奖特码进行投注，任选3个号码组成一注。所选的3个号码中任一号码与开奖特码相同，即为中奖。"
          }]
      }]
  }, {
      "title": "特码",
      "children": [{
          "title": "特码",
          "children": [{
              "title": "特码",
              "content": "对开奖特码进行投注，任选1个号码组成一注。所选号与开奖特码相同，即为中奖。"
          }]
      }]
  }]

  },
  {
    title: '六合彩',
    title_en: 'lhc',
    children: [
      {'game_id':3, 'name': '香港⑥合彩', 'name_en': 'xg6hc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':7, 'name': '极速六合彩', 'name_en': 'js6hc', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':8, 'name': '分分六合彩', 'name_en': 'ff6hc', time: '', 'game_link':'', 'bet_type':{}}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "每期从01-49中随机开出7个号码，首6个号码为：正码，第7个号码为：特码。"
      }, {
          "content": "具体规则说明如下：",
          "children": [{
              "content": "特码大小单双",
              "children": [{
                  "title": "特大",
                  "content": "开出的特码在25~48范围内。"
              }, {
                  "title": "特小",
                  "content": "开出的特码在01~24范围内。"
              }, {
                  "title": "特双",
                  "content": "特码为双数，如18、20、34、42。"
              }, {
                  "title": "特单",
                  "content": "特码为单数，如01、11、35、47。"
              }, {
                  "title": "和局",
                  "content": "特码为49。"
              }]
          }, {
              "content": "特码合数大小单双",
              "children": [{
                  "title": "合大",
                  "content": "指特码的个位加上十位之和大于等于7，如07、09、43、36。"
              }, {
                  "title": "合小",
                  "content": "指特码的个位与十位相加之和小于等于6，如30、14、22。"
              }, {
                  "title": "合双",
                  "content": "指指特码的个位加上十位之和为“双数”，如02、11、33、44。"
              }, {
                  "title": "合单",
                  "content": "指特码的个位加上十位之和为“单数”，如01、14、36、47。"
              }, {
                  "title": "和局",
                  "content": "当期开出的特码为49时，视为和局，自动返还投注本金。"
              }]
          }, {
              "content": "特码尾数大小",
              "children": [{
                  "title": "特尾大",
                  "content": "5尾~9尾为大，如05、18、19。"
              }, {
                  "title": "特尾小",
                  "content": "0尾~4尾为小，如01、32、44。"
              }, {
                  "title": "和局",
                  "content": "当期开出的特码为49时，视为和局，自动返还投注本金。"
              }]
          }, {
              "content": "总和大小单双",
              "children": [{
                  "title": "总和大",
                  "content": "当期开奖号码的7个号码相加之和大于或等于175。"
              }, {
                  "title": "总和小",
                  "content": "当期开奖号码的7个号码相加之和小于或等于174。"
              }, {
                  "title": "总和单",
                  "content": "当期开奖号码的7个号码相加之和为奇数。"
              }, {
                  "title": "总和双",
                  "content": "当期开奖号码的7个号码相加之和为偶数。"
              }]
          }, {
              "content": "生肖，顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪 ，如今年是狗年，则以狗开始，依顺序将49个号码分为12个生肖，具体如下：",
              "children": [{
                  "title": "狗",
                  "content": "01、13、25、37、49"
              }, {
                  "title": "鸡",
                  "content": "02、14、26、38"
              }, {
                  "title": "猴",
                  "content": "03、15、27、39"
              }, {
                  "title": "羊",
                  "content": "04、16、28、40"
              }, {
                  "title": "马",
                  "content": "05、17、29、41"
              }, {
                  "title": "蛇",
                  "content": "06、18、30、42"
              }, {
                  "title": "龙",
                  "content": "07、19、31、43"
              }, {
                  "title": "兔",
                  "content": "08、20、32、44"
              }, {
                  "title": "虎",
                  "content": "09、21、33、45"
              }, {
                  "title": "牛",
                  "content": "10、22、34、46"
              }, {
                  "title": "鼠",
                  "content": "11、23、35、47"
              }, {
                  "title": "豬",
                  "content": "12、24、36、48"
              }],
              "ps": "注：生肖中49亦算输赢，不为和；十二生肖属性会根据每年的农历年而变更。"
          }, {
              "content": "色波，指49个号码球分别有红、蓝、绿三种颜色，以特码开出的颜色和投注的颜色相同视为中奖，颜色代表如下：",
              "children": [{
                  "title": "红波",
                  "content": "01、02、07、08、12、13、18、19、23、24、29、30、34、35、40、45、46"
              }, {
                  "title": "蓝波",
                  "content": "03、04、09、10、14、15、20、25、26、31、36、37、41、42、47、48"
              }, {
                  "title": "绿波",
                  "content": "05、06、11、16、17、21、22、27、28、32、33、38、39、43、44、49"
              }]
          }, {
              "content": "特码头数",
              "children": [{
                  "title": "'0'头",
                  "content": "01、02、03、04、05、06、07、08、09"
              }, {
                  "title": "'1'头",
                  "content": "10、11、12、13、14、15、16、17、18、19"
              }, {
                  "title": "'2'头",
                  "content": "20、21、22、23、24、25、26、27、28、29"
              }, {
                  "title": "'3'头",
                  "content": "30、31、32、33、34、35、36、37、38、39"
              }, {
                  "title": "'4'头",
                  "content": "40、41、42、43、44、45、46、47、48、49"
              }]
          }, {
              "content": "特码尾数",
              "children": [{
                  "title": "'0'尾",
                  "content": "10、20、30、40"
              }, {
                  "title": "'1'尾",
                  "content": "01、11、21、31、41"
              }, {
                  "title": "'2'尾",
                  "content": "02、12、22、32、42"
              }, {
                  "title": "'3'尾",
                  "content": "03、13、23、33、43"
              }, {
                  "title": "'4'尾",
                  "content": "04、14、24、34、44"
              }, {
                  "title": "'5'尾",
                  "content": "05、15、25、35、45"
              }, {
                  "title": "'6'尾",
                  "content": "06、16、26、36、46"
              }, {
                  "title": "'7'尾",
                  "content": "07、17、27、37、47"
              }, {
                  "title": "'8'尾",
                  "content": "08、18、28、38、48"
              }, {
                  "title": "'9'尾",
                  "content": "09、19、29、39、49"
              }]
          }, {
              "content": "五行",
              "children": [{
                  "title": "金",
                  "content": "04 05 18 19 26 27 34 35 48 49"
              }, {
                  "title": "木",
                  "content": "01 08 09 16 17 30 31 38 39 46 47"
              }, {
                  "title": "水",
                  "content": "06 07 14 15 22 23 36 37 44 45"
              }, {
                  "title": "火",
                  "content": "02 03 10 11 24 25 32 33 40 41"
              }, {
                  "title": "土",
                  "content": "12 13 20 21 28 29 42 43"
              }]
          }]
      }],
      "timing": [{
          "title": "香港六合彩",
          "content": "每周开奖3期，通常于周二、周四及非赛马日的周六或周日21:35开奖"
      }, {
          "title": "极速六合彩",
          "content": "每5分钟一期，24小时不间断开奖，全天开奖288期"
      }, {
          "title": "分分六合彩",
          "content": "00:00-00:00（次日），每1分钟一期，全天1440期"
      }]
  },
  "rule": [{
      "title": "两面",
      "children": [{
          "title": "两面",
          "children": [{
              "title": "两面",
              "content": "指大小单双。对特码的总和及形态或正码1-6的合数及形态进行投注。所选号与开奖号的位置、形态相同，即为中奖，特码开出49为和局，退还本金。"
          }]
      }]
  }, {
      "title": "特码",
      "children": [{
          "title": "特码",
          "children": [{
              "title": "特码",
              "content": "当期开出的第七个号码为特码，从01-49中任选1个号码组成一注。所选号码与开奖特码相同，即为中奖。"
          }]
      }]
  }, {
      "title": "正码",
      "children": [{
          "title": "正码",
          "children": [{
              "title": "正码",
              "content": "从01-49中任选1个号码组成一注。不限顺序，开奖的正码中包含投注号，即为中奖。"
          }]
      }]
  }, {
      "title": "正码特",
      "children": [{
          "title": "正码特",
          "children": [{
              "title": "正码特",
              "content": "从01-49中任选1个号码组成一注。不限顺序，开奖的正码中包含投注号，即为中奖。"
          }]
      }]
  }, {
      "title": "正码1-6",
      "children": [{
          "title": "正码1-6",
          "children": [{
              "title": "正码1-6",
              "content": "任选1个形态组成一注。投注号与开奖号的正码位置、形态相同，即为中奖。所选位置开出49则为和局。"
          }, {
              "title": "大小",
              "content": "指定出现正码的位置与号码大于或等于25为大，小于或等于24为小，开出49为和。"
          }, {
              "title": "单双",
              "content": "以指定出现正码的位置与号码为单数或双数下注，开出49为和。"
          }, {
              "title": "合数大小",
              "content": "以指定出现正码的位置与号码个位和十位的数字和值来判断大小，和数大于或等于7为大，小于或等于6为小，开出49为和。"
          }, {
              "title": "合数单双",
              "content": "以指定出现正码的位置与号码个位和十位数字和值来判断单双，开出49为和。"
          }, {
              "title": "色波",
              "content": "以指定出现正码的位置的球色下注，开奖的球色与下注的颜色相同，即为中奖。"
          }, {
              "title": "尾数大小",
              "content": "以指定出现正码的位置与号码尾数大小下注，0尾~4尾为小、5尾~9尾为大，开出49为和。"
          }]
      }]
  }, {
      "title": "正码过关",
      "children": [{
          "title": "正码过关",
          "children": [{
              "title": "正码过关",
              "content": "从正一至正六中任选2个位置，并各选1个形态组成一注。所选形态与相同位置上的开奖形态一致，即为中奖。可同时选投多个正码形态，串联成投注组合，赔率为所选串联赔率的总乘积。"
          }]
      }]
  }, {
      "title": "连码",
      "children": [{
          "title": "连码",
          "children": [{
              "title": "四全中",
              "content": "对开奖正码进行投注，任选4个号码为一注。不限顺序，开奖正码中包含4个所选号，即为中奖。"
          }, {
              "title": "三全中",
              "content": "对开奖正码进行投注，任选3个号码为一注。不限顺序，开奖正码中包含3个所选号，即为中奖。"
          }, {
              "title": "三中二",
              "content": "对开奖正码进行投注，任选3个号码为一 注。不限顺序，开奖正码中包含所选号中的任意2个号码，即中“三中二”；正码中包含3个所选号，即中“三中二之中三。"
          }, {
              "title": "二全中",
              "content": "对开奖正码进行投注，任选2个号码为一注。不限顺序，开奖正码中包含2个所选号，即为中奖。"
          }, {
              "title": "二中特",
              "content": "从01-49中任选2个号码为一注。开奖正码中包含2个所选号，则中“二中特之中二”；若所选号中1个是正码，1个是特码，则中“二全中之中特”。"
          }, {
              "title": "特串",
              "content": "从01-49中任选2个号码为一注。2个所选号一个出现在开奖正码中，一个出现在开奖特码中，即为中奖。"
          }]
      }]
  }, {
      "title": "连肖连尾",
      "children": [{
          "title": "连肖连尾",
          "children": [{
              "title": "连肖连尾",
              "content": "对7个开奖号码所属的生肖或尾数进行投注。不限顺序，7个开奖号中包含全部所选生肖或尾数，即为中奖。"
          }]
      }]
  }, {
      "title": "自选不中",
      "children": [{
          "title": "自选不中",
          "children": [{
              "title": "自选不中",
              "content": "7个开奖号中均不包含全部所选号，即为中奖。"
          }]
      }]
  }, {
      "title": "生肖",
      "children": [{
          "title": "生肖",
          "children": [{
              "title": "特肖",
              "content": "对开奖特码所属的生肖进行投注，任选1个生肖为一注。开奖特码在所选生肖范围内，即为中奖。"
          }, {
              "title": "正肖",
              "content": "对6个开奖正码所属的生肖进行投注，任选1个生肖组成一注。不限顺序，6个开奖正码中任意1个号码在所选生肖范围内，即为中奖。若有N个开奖正码在所选生肖范围内，中奖金额=本金*（赔率-1）*中奖次数+本金。"
          }, {
              "title": "一肖",
              "content": "对7个开奖号码所属的生肖范围进行投注，任选1个生肖为一注。7个开奖号中任意一个号码在所选生肖的范围内，即为中奖。"
          }, {
              "title": "总肖",
              "content": "对7个开奖号的不同生肖总数及总肖的单双形态进行投注，任选1个组成一注。总肖单双指7个开奖号所属的生肖总数为单数或双数。投注类型与7个开奖号类型相符，即为中奖。"
          }]
      }]
  }, {
      "title": "合肖",
      "children": [{
          "title": "合肖",
          "children": [{
              "title": "合肖",
              "content": "对开奖特码所属生肖进行投注，任选2个生肖为一注。开奖特码在所选生肖范围内，即为中奖，特码开出49为和局，退还本金。"
          }, {
              "title": "野兽",
              "content": "鼠（11 23 35 47）、虎（09 21 33 45）、兔（08 20 32 44）、龙（07 19 31 43）、蛇（06 18 30 42）、猴（03 15 27 39）"
          }, {
              "title": "家禽",
              "content": "牛（10 22 34 46）、马（05 17 29 41）、羊（04 16 28 40）、鸡（02 14 26 38）、狗（01 13 25 37 49）、猪（12 24 36 48）"
          }, {
              "title": "天肖",
              "content": "牛（10 22 34 46）、兔（08 20 32 44）、龙（07 19 31 43）、马（05 17 29 41）、猴（03 15 27 39）、猪（12 24 36 48）"
          }, {
              "title": "地肖",
              "content": "鼠（11 23 35 47）、虎（09 21 33 45）、蛇（06 18 30 42）、羊（04 16 28 40）、鸡（02 14 26 38）、狗（01 13 25 37 49）"
          }, {
              "title": "前肖",
              "content": "鼠（11 23 35 47）、牛（10 22 34 46）、虎（09 21 33 45）、兔（08 20 32 44）、龙（07 19 31 43）、蛇（06 18 30 42）"
          }, {
              "title": "后肖",
              "content": "马（05 17 29 41）、羊（04 16 28 40）、猴（03 15 27 39）、鸡（02 14 26 38）、狗（01 13 25 37 49）、猪（12 24 36 48）"
          }]
      }]
  }, {
      "title": "色波",
      "children": [{
          "title": "色波",
          "children": [{
              "title": "三色波",
              "content": "对开奖特码的色波进行投注，任选1个色波为一注。所选波色与开奖特码的色波相同，即为中奖。"
          }, {
              "title": "半波",
              "content": "以开奖特码的色波和大小单双为一个组合，任选1个组合为一注。所选组合与开奖特码相符，即为中奖。如开奖特码为49，则为和局，系统自动退还投注金额。"
          }, {
              "title": "半半波",
              "content": "以开奖特码的色波和大单大双小单小双为一个组合，任选1个组合为一注。所选组合与开奖特码相符，即为中奖。如开奖号特码为49，则为和局，系统自动退还投注金额。"
          }, {
              "title": "七色波",
              "content": "以7个开奖号的色波，哪个颜色最多为中奖色波。7个开奖号最多的色波与所选色波相同，即为中奖。以下3种结果视为和局：6个正码开出3蓝3绿，特码是1.5红 6个正码开出3蓝3红，特码是1.5绿 6个正码开出3绿3红，特码是1.5蓝 如投注红、蓝、绿波时开出和局，则系统自动退还投注金额；会员也可以下注“和局”。"
          }]
      }]
  }, {
      "title": "尾数",
      "children": [{
          "title": "尾数",
          "children": [{
              "title": "头尾数",
              "content": "对开奖特码头（十位）或尾（个位）数进行投注，任选1个类型为一注。所选的头数或尾数与开奖特码位置、号码相同，即为中奖。"
          }, {
              "title": "正特尾数",
              "content": "对6个正码和特码的尾数进行投注，任选1个类型为一注。6个正码或特码中任意一个尾数与所选尾数相同，即为中奖。"
          }]
      }]
  }, {
      "title": "七码五行",
      "children": [{
          "title": "七码五行",
          "children": [{
              "title": "七码",
              "content": "对7个开奖号中大小单双各有多少个进行投注，任选1个类型为一注。所选的大小单双数量与7个开奖号的大小单双数量相同，即为中奖。"
          }, {
              "title": "五行",
              "content": "对开奖特码所属的五行进行投注，任选1个为一注。开奖特码在所选的五行范围内，即为中奖。"
          }]
      }]
  }, {
      "title": "中一",
      "children": [{
          "title": "中一",
          "children": [{
              "title": "中一",
              "content": "对应不同的选号数量要求，所选号码在当期7个开奖号码中出现任意1个，即为中奖，出现2个或以上所选号，则不中奖。"
          }]
      }]
  }]

  },
  {
    title: 'PK10',
    title_en: 'pk10',
    children: [
      {'game_id':4, 'name': '极速PK拾', 'name_en': 'jspk10', time: '全天24小时不间断开奖，每1分钟一期，全天1440期', 'game_link':'', 'bet_type':{}},
      {'game_id':1, 'name': '北京PK拾', 'name_en': 'bjpks', time: '9：02-23：57，每5分钟一期，全天179期', 'game_link':'/pk10', 'bet_type':{
        '1':'前一',
        '2':'前二复式',
        '3':'前二单式',
        '4':'前三复式',
        '5':'前三单式',
        '6':'定位胆第1~5名',
        '7':'定位胆第6~10名',
        '8':'冠亚和',
        '9':'龙虎冠军',
        '10':'龙虎亚军',
        '11':'龙虎季军',
        '12':'龙虎第四名',
        '13':'龙虎第五名',
        '14':'五行冠军',
        '15':'五行亚军',
        '16':'五行季军',
        '17':'大小单双大小冠军',
        '18':'大小单双大小亚军',
        '19':'大小单双大小季军',
        '20':'大小单双单双冠军',
        '21':'大小单双单双亚军',
        '22':'大小单双单双季军',
        '23':'大小单双冠亚和大小单双'
      }}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "每期从01-10中随机开出10个号码作为当期开奖车号，顺序从左至右。"
      }, {
          "content": "PK拾采用排列式玩法。从左至右共有十个投注位置，排列顺序分别为一至十号位置，每个位置可从01-10的自然数中选择一个号码。"
      }, {
          "content": "先选择投注位置个数，投注位置个数最少一个、最多十个，在所选位置上从01-10的自然数中选择一个号码进行投注。"
      }, {
          "content": "若投注位置个数超过两个的，后选位置的投注号码不能与前面所有已选位置的投注号码相同。"
      }, {
          "content": "所选号码按位置顺序排序组成一组号码，该组号码即为一注PK拾投注号码。"
      }],
      "timing": [{
          "title": "北京PK拾",
          "content": "9:02-23:57，每5分钟一期，全天179期"
      }, {
          "title": "极速PK拾",
          "content": "全天24小时不间断开奖，每1分钟一期，全天1440期"
      }]
  },
  "rule": [{
      "title": "前一",
      "children": [{
          "title": "前一",
          "children": [{
              "title": "前一",
              "content": "从01-10中任选1个号码组成一注。所选号与开奖号第一位相同，即为中奖。"
          }]
      }]
  }, {
      "title": "前二",
      "children": [{
          "title": "前二",
          "children": [{
              "title": "前二",
              "content": "从第一位、第二位中各选1个不同的号码组成一注。所选号与开奖号前两位号码相同，且顺序一致，即为中奖。"
          }]
      }]
  }, {
      "title": "前三",
      "children": [{
          "title": "前三",
          "children": [{
              "title": "前三",
              "content": "从第一位至第三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }]
      }]
  }, {
      "title": "定位胆",
      "children": [{
          "title": "定位胆",
          "children": [{
              "title": "定位胆",
              "content": "从任意位置上选1个号码进行投注。所选号与相同位置上的开奖号一致，即为中奖。"
          }]
      }]
  }, {
      "title": "冠亚和",
      "children": [{
          "title": "冠亚和",
          "children": [{
              "title": "和值",
              "content": "从3-19中任选1个号码组成一注。所选号等于开奖号冠、亚军车号相加之和，即为中奖。"
          }]
      }]
  }, {
      "title": "龙虎",
      "children": [{
          "title": "龙虎",
          "children": [{
              "title": "冠军",
              "content": "对冠军车号大于第十名车号为龙，小则为虎进行投注，任选1个形态为一注。所选形态与开奖号的冠军车号大于或小于第十名的形态相同，即为中奖。"
          }, {
              "title": "亚军",
              "content": "对亚军车号大于第九名车号为龙，小则为虎进行投注，任选1个形态为一注。所选形态与开奖号的亚军车号大于或小于第九名的形态相同，即为中奖。"
          }, {
              "title": "季军",
              "content": "对季军车号大于第八名车号为龙，小则为虎进行投注，任选1个形态为一注。所选形态与开奖号的季军车号大于或小于第八名的形态相同，即为中奖。"
          }, {
              "title": "第四名",
              "content": "对第四名车号大于第七名车号为龙，小则为虎进行投注，任选1个形态为一注。所选形态与开奖号的第四名车号大于或小于第七名的形态相同，即为中奖。"
          }, {
              "title": "第五名",
              "content": "对第五名车号大于第六名车号为龙，小则为虎进行投注，任选1个形态为一注。所选形态与开奖号的第五名车号大于或小于第六名的形态相同，即为中奖。"
          }]
      }]
  }, {
      "title": "五行",
      "children": [{
          "title": "五行",
          "children": [{
              "title": "冠军",
              "content": "对开奖号冠军号码所属的五行进行投注，任选一个组合为一注。开奖号冠军号码在所选五行的范围内，即为中奖。金：01 02，木：03 04，水：05 06，火：07 08，土：09 10。"
          }, {
              "title": "亚军",
              "content": "对开奖号亚军号码所属的五行进行投注，任选一个组合为一注。开奖号亚军号码在所选五行的范围内，即为中奖。金：01 02，木：03 04，水：05 06，火：07 08，土：09 10。"
          }, {
              "title": "季军",
              "content": "对开奖号季军号码所属的五行进行投注，任选一个组合为一注。开奖号季军号码在所选五行的范围内，即为中奖。金：01 02，木：03 04，水：05 06，火：07 08，土：09 10。"
          }]
      }]
  }, {
      "title": "大小单双",
      "children": [{
          "title": "大小单双",
          "children": [{
              "title": "冠亚季军",
              "content": "对开奖号冠、亚、季军的车号大（06~10）小（01~05）单双进行投注。所选形态与相同位置上的开奖号形态一致，即为中奖。"
          }, {
              "title": "冠亚和",
              "content": "对冠、亚军车号相加之和的大（12~19）小（3~11）单双进行投注，任选一个形态为一注。所选形态符合开奖号冠、亚军车号相加之和的形态，即为中奖。"
          }]
      }]
  }]
  },
  {
    title: '11选5',
    title_en: 'syx5',
    children: [
      {'game_id':-1, 'name': '山东11选5', 'name_en': 'sd11x5', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '上海11选5', 'name_en': 'sh11x5', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '江西11选5', 'name_en': 'jx11x5', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':4, 'name': '广东11选5', 'name_en': 'gd11x5', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '安徽11选5', 'name_en': 'ah11x5', time: '', 'game_link':'', 'bet_type':{}}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "11选5号码投注范围01-11，每期开出5个号码作为开奖号，顺序从左至右。"
      }, {
          "content": "11选5玩法即竞猜5位开奖号码的全部或部分号码。"
      }, {
          "content": "直选：将投注号码以惟一的排列方式进行投注。"
      }, {
          "content": "组选：将投注号码的所有排列方式作为一注投注号码进行投注，即号码顺序不限，开奖号中包含投注号码则中奖。示例：前三组选01 02 03，排列方式有01 02 03、01 03 02、02 01 03、02 03 01、03 01 02、03 02 01，共计6种。"
      }],
      "timing": [{
          "title": "山东11选5",
          "content": "8:31-22:11，每10分钟一期，全天78期"
      }, {
          "title": "上海11选5",
          "content": "9:00-23:50，每10分钟一期，全天90期"
      }, {
          "title": "江西11选5",
          "content": "9:10-23:00，每10分钟一期，全天84期"
      }, {
          "title": "广东11选5",
          "content": "9:11-23:01，每10分钟一期，全天84期"
      }, {
          "title": "安徽11选5",
          "content": "8:42-22:02，每10分钟一期，全天81期"
      }, {
          "title": "分分11选5",
          "content": "00:00-00:00（次日），每1分钟一期，全天1440期"
      }]
  },
  "rule": [{
      "title": "三码",
      "children": [{
          "title": "前三直选",
          "children": [{
              "title": "复式",
              "content": "从第一、二、三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个三位不同的号码组成一注。输入号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }]
      }, {
          "title": "前三组选",
          "children": [{
              "title": "复式",
              "content": "从01-11中任选3个不同的号码组成一注。不限顺序，开奖号前三位中包含全部所选号，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个三位不同的号码组成一注。不限顺序，开奖号前三位号码中包含3个输入号，即为中奖。"
          }]
      }]
  }, {
      "title": "二码",
      "children": [{
          "title": "前二直选",
          "children": [{
              "title": "复式",
              "content": "从第一、二位中各选1个不同的号码组成一注。所选号与开奖号前两位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位不同的号码组成一注。输入号与开奖号前两位号码相同，且顺序一致，即为中奖。"
          }]
      }, {
          "title": "前二组选",
          "children": [{
              "title": "复式",
              "content": "从01-11中任选2个不同的号码组成一注。不限顺序，开奖号前两位中包含全部所选号，即为中奖。"
          }, {
              "title": "单式",
              "content": "手动输入1个两位不同的号码组成一注。不限顺序，开奖号前两位中包含2个输入号，即为中奖。"
          }]
      }]
  }, {
      "title": "不定胆",
      "children": [{
          "title": "不定胆",
          "children": [{
              "title": "前三位",
              "content": "从01-11中任选1个号码组成一注。不限顺序，开奖号前三位任意一位中包含所选号，即为中奖。"
          }]
      }]
  }, {
      "title": "定位胆",
      "children": [{
          "title": "定位胆",
          "children": [{
              "title": "定位胆",
              "content": "任选1个位置并选1个号码组成一注。所选号与相同位置上的开奖号一致，即为中奖。"
          }]
      }]
  }, {
      "title": "任选",
      "children": [{
          "title": "任选复式",
          "children": [{
              "title": "一中一",
              "content": "从01-11中任选1个号码组成一注。不限顺序，开奖号中包含1个所选号，即为中奖。"
          }, {
              "title": "二中二",
              "content": "从01-11中任选2个号码组成一注。不限顺序，开奖号中包含2个所选号，即为中奖。"
          }, {
              "title": "三中三",
              "content": "从01-11中任选3个号码组成一注。不限顺序，开奖号中包含3个所选号，即为中奖。"
          }, {
              "title": "四中四",
              "content": "从01-11中任选4个号码组成一注。不限顺序，开奖号中包含4个所选号，即为中奖。"
          }, {
              "title": "五中五",
              "content": "从01-11中任选5个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。"
          }, {
              "title": "六中五",
              "content": "从01-11中任选6个号码组成一注。不限顺序，开奖号中包含6个所选号中的任意5个号码，即为中奖。"
          }, {
              "title": "七中五",
              "content": "从01-11中任选7个号码组成一注。不限顺序，开奖号中包含7个所选号中的任意5个号码，即为中奖。"
          }, {
              "title": "八中五",
              "content": "从01-11中任选8个号码组成一注。不限顺序，开奖号中包含8个所选号中的任意5个号码，即为中奖。"
          }]
      }, {
          "title": "任选单式",
          "children": [{
              "title": "一中一",
              "content": "从01-11中手动输入1个号码组成一注。不限顺序，开奖号中包含1个输入号，即为中奖。"
          }, {
              "title": "二中二",
              "content": "从01-11中手动输入2个号码组成一注。不限顺序，开奖号中包含2个输入号，即为中奖。"
          }, {
              "title": "三中三",
              "content": "从01-11中手动输入3个号码组成一注。不限顺序，开奖号中包含3个输入号，即为中奖。"
          }, {
              "title": "四中四",
              "content": "从01-11中手动输入4个号码组成一注。不限顺序，开奖号中包含4个输入号，即为中奖。"
          }, {
              "title": "五中五",
              "content": "从01-11中手动输入5个号码组成一注。不限顺序，开奖号中包含全部输入号，即为中奖。"
          }, {
              "title": "六中五",
              "content": "从01-11中手动输入6个号码组成一注。不限顺序，开奖号中包含6个输入号中的任意5个号码，即为中奖。"
          }, {
              "title": "七中五",
              "content": "从01-11中手动输入7个号码组成一注。不限顺序，开奖号中包含7个输入号中的任意5个号码，即为中奖。"
          }, {
              "title": "八中五",
              "content": "从01-11中手动输入8个号码组成一注。不限顺序，开奖号中包含8个输入号中的任意5个号码，即为中奖。"
          }]
      }]
  }]

  },
  {
    title: '低频彩',
    title_en: 'dpc',
    children: [
      {'game_id':-1, 'name': '排列三', 'name_en': 'pail3', time: '', 'game_link':'', 'bet_type':{}},
      {'game_id':-1, 'name': '福彩3D', 'name_en': 'fc3d', time: '', 'game_link':'', 'bet_type':{}}
    ],
    "introduce": {
      "simpleIntro": [{
          "content": "每期从0-9中随机开出3个号码作为开奖号。"
      }, {
          "content": "玩法分为定位胆、不定胆和排列三，具体玩法说明如下：",
          "children": [{
              "content": "定位胆：在任意位置上选1个号码"
          }, {
              "content": "不定胆",
              "children": [{
                  "content": "直选：选择三个数字投注，顺序一致。将投注号码以唯一的排列方式进行投注。"
              }, {
                  "content": "组选三：选择三个数字投注，顺序不限，但投注的三位号码有两位相同（对子）。有2个数字相同的3个数字有3种不同的排列方式，即1次投注有3个中奖机会，这种投注方式为组选三。示例：112，排列方式有112、121、211。"
              }, {
                  "content": "组选六：选择三个数字投注，顺序不限，且投注的三位号码各不相同。3个不同的数字有6种不同的排列方式，即1次投注有6个中奖机会，这种投注方式为组选六。示例：123，排列方式有123、132、213、231、312、321。"
              }]
          }]
      }],
      "timing": [{
          "title": "排列三",
          "content": "一天一期，每天20:30开奖"
      }, {
          "title": "福彩3D",
          "content": "一天一期，每天21:15开奖"
      }, {
          "title": "极速3D",
          "content": "00:00-00:00（次日），每1分钟一期，全天1440期"
      }]
  },
  "rule": [{
      "title": "三码",
      "children": [{
          "title": "直选",
          "children": [{
              "title": "直选-复式",
              "content": "从第一、二、三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "直选-和值",
              "content": "从0-27中任选1个号码组成一注。所选号等于开奖号的三个号码相加之和，即为中奖。"
          }]
      }, {
          "title": "组选",
          "children": [{
              "title": "组选-组三",
              "content": "从0-9中任选2个号码组成两注。不限顺序，开奖号中包含全部所选号，且其中一个号码出现2次，即为中奖。"
          }, {
              "title": "组选-组六",
              "content": "从0-9中任选3个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。"
          }, {
              "title": "组选-混合",
              "content": "从第一、二、三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。"
          }]
      }]
  }, {
      "title": "二码",
      "children": [{
          "title": "后二码直选",
          "children": [{
              "title": "复式",
              "content": "从十、个位中各选1个号码组成一注。所选号与开奖号十、个位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "和值",
              "content": "从0-18中任选1个号码组成一注。所选号等于开奖号十、个位两个号码相加之和，即为中奖。"
          }]
      }, {
          "title": "后二码组选",
          "children": [{
              "title": "复式",
              "content": "从0-9中任选2个号码组成一注。不限顺序，所选号与开奖号十、个位相同，即为中奖。"
          }]
      }, {
          "title": "前二码直选",
          "children": [{
              "title": "复式",
              "content": "从百、十位中各选1个号码组成一注。所选号与开奖号百、十位号码相同，且顺序一致，即为中奖。"
          }, {
              "title": "和值",
              "content": "从0-18中任选1个号码组成一注。所选号等于开奖号百、十位两个号码相加之和，即为中奖。"
          }]
      }, {
          "title": "前二码组选",
          "children": [{
              "title": "复式",
              "content": "从0-9中任选2个号码组成一注。不限顺序，开奖号百、十位中包含全部所选号，即为中奖。"
          }]
      }]
  }, {
      "title": "定位胆",
      "children": [{
          "title": "定位胆",
          "children": [{
              "title": "定位胆",
              "content": "任选1个位置并选1个号码组成一注。所选号与相同位置上的开奖号一致，即为中奖。"
          }]
      }]
  }, {
      "title": "不定胆",
      "children": [{
          "title": "不定胆",
          "children": [{
              "title": "一码不定胆",
              "content": "从0-9中任选1个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。"
          }]
      }]
  }]

  }
]
